using System;

/*
 * Создайте собственное пространство имен MyNamespace с классом MyClass и подключите его в другом приложении.
 */

namespace MyNamespace
{
    public class Class1
    {
        public void Method()
        {
            Console.WriteLine("Method from MyNamespace.Class1");
        }
    }
}
